
### Data Analysis with Pandas

##### Import and use Pandas

In [1]:
import pandas as pd
 
#create new series
numbers_series = pd.Series([1,2,3,4])
#print(number_series)

#create new Data Frame
user_data = pd.DataFrame({
    "Name": ["Samyog", "Atit", "Ansh"],
    "Age": [20, 22, 22],
    "Address": ["Kathmandu", "Bhaktapur", "Kathmandu"]
})
user_data = pd.DataFrame(user_data)
user_data

     Name  Age    Address
0  Samyog   20  Kathmandu
1    Atit   22  Bhaktapur
2    Ansh   22  Kathmandu

### Read data from CSV, Excel and JSON file

In [9]:
import pandas as pd
# read data from csv
student_csv_data = pd.read_csv('data/student.csv')
student_csv_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

### Read from excel

In [11]:
import pandas as pd
# read data from excel
student_excel_data = pd.read_excel('data/student.xlsx')
student_excel_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

### Read from JSON

In [12]:
import pandas as pd
# read data from json
student_json_data = pd.read_json('data/student.json')
student_json_data.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

### Save Pandas Dataframe to csv, excel and JSON file

In [5]:
# create new Data Frame
user_data = pd.DataFrame({
    "Name": ["Ram", "Hari"],
    "Age": [20,23],
    "Address": ["Kathmandu","Lalitpur"]   
})
user_data.to_csv('data/user_data.csv')
user_data.to_excel('data/user_data.xlsx')
user_data.to_json('data/user_data.json')

### Basic Data Exploration

Data inspection

In [8]:
import pandas as pd 
students = pd.read_csv('data/student.csv')
students.shape
students.head() # print top n =5 rows
print(students.tail()) #print bottom n=5 rows
print(students.info())
students.describe

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    35 non-null     object
 2   class   35 non-null     object
 3   mark    35 non-null     int64
 4   gender  35 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB
None

<bound method NDFrame.describe of     id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female>

## Basic Indexing

In [9]:
print(students['name']) #single column as a series
new_std_data = students[['id','name','mark']].copy()
print(new_std_data) # multiple columns as a DataFrame

#slicing rows
first_10_rows = students[:10].copy()
print(first_10_rows) #only first row (dataframe)
last_five_rows = students[30:].copy()
print(last_five_rows)

0        John Deo
1        Max Ruin
2          Arnold
3      Krish Star
4       John Mike
5       Alex John
6     My John Rob
7          Asruid
8         Tes Qry
9        Big John
10         Ronald
11          Recky
12            Kty
13           Bigy
14       Tade Row
15          Gimmy
16          Tumyu
17          Honny
18          Tinny
19         Jackly
20     Babby John
21         Reggid
22          Herod
23      Tiddy Now
24       Giff Tow
25         Crelea
26       Big Nose
27      Rojj Base
28    Tess Played
29      Reppy Red
30    Marry Toeey
31      Binn Rott
32      Kenn Rein
33       Gain Toe
34     Rows Noump
Name: name, dtype: object
    id         name  mark
0    1     John Deo    75
1    2     Max Ruin    85
2    3       Arnold    55
3    4   Krish Star    60
4    5    John Mike    60
5    6    Alex John    55
6    7  My John Rob    78
7    8       Asruid    85
8    9      Tes Qry    78
9   10     Big John    55
10  11       Ronald    89
11  12        Recky    94
12  13          Kty    88
13  14         Bigy    88
14  15     Tade Row    88
15  16        Gimmy    88
16  17        Tumyu    54
17  18        Honny    75
18  19        Tinny    18
19  20       Jackly    65
20  21   Babby John    69
21  22       Reggid    55
22  23        Herod    79
23  24    Tiddy Now    78
24  25     Giff Tow    88
25  26       Crelea    79
26  27     Big Nose    81
27  28    Rojj Base    86
28  29  Tess Played    55
29  30    Reppy Red    79
30  31  Marry Toeey    88
31  32    Binn Rott    90
32  33    Kenn Rein    96
33  34     Gain Toe    69
34  35   Rows Noump    88
   id         name  class  mark  gender
0   1     John Deo   Four    75  female
1   2     Max Ruin  Three    85    male
2   3       Arnold  Three    55    male
3   4   Krish Star   Four    60  female
4   5    John Mike   Four    60  female
5   6    Alex John   Four    55    male
6   7  My John Rob  Fifth    78    male
7   8       Asruid   Five    85    male
8   9      Tes Qry    Six    78    male
9  10     Big John   Four    55  female
    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

### Label-based Indexing (,loc[])

In [12]:
#selecting rows based on label 
students = pd.read_csv('data/student.csv')
first_row = students.loc[1]
first_two_rows = students.loc[0:2]
print(first_row)
print(first_two_rows)

##selecting specific rows to columns 
first_two_stds_with_name_to_marks = students.loc[0:2,'name':'mark']
print(first_two_stds_with_name_to_marks)

first_and_second_row_with_name_and_gender = students.loc[[5,20], ['name','gender']]
first_and_second_row_with_name_and_gender

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object
   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male
       name  class  mark
0  John Deo   Four    75
1  Max Ruin  Three    85
2    Arnold  Three    55

          name  gender
5    Alex John    male
20  Babby John  female

In [13]:
print(students.iloc[1])
print(students.iloc[0:3])

# Selecting specific rows and columns
print(students.iloc[0:2])
print(students.iloc[[0,2], [0,2]])

id               2
name      Max Ruin
class        Three
mark            85
gender        male
Name: 1, dtype: object
   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male
   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
   id  class
0   1   Four
2   3  Three

## Single Value Access (.at[] and .iat[])

In [14]:
#Using .at[] to access single value by label
print(students.at[1,'name'])    #Value in row 1, column 'name'

#Using .iat[] to access single value by position
print(students.iat[6,1])    #Value in row 6, column 1

Max Ruin
My John Rob